app/controllers/lyrics_controller.rb

SELECT * FROM "lyrics" WHERE (title LIKE 'Californicationmoney')
---
  def index
    @lyrics = Lyric.search(params[:search])

SELECT * FROM "lyrics" WHERE ("lyrics"."id" = 1)
---
  def show
    @lyric = Lyric.find(params[:id])

SELECT * FROM "lyrics" WHERE ("lyrics"."id" = 2)
---
  def edit
    @lyric = Lyric.find(params[:id])

INSERT INTO "lyrics" ("artist", "lyrics", "created_at", "title", "image_url", "updated_at", "album", "year") VALUES('Evenescence', 'One Thing, I don''t know why', '2010-03-31 05:45:20', 'Come all Ye Faithful', 'www.spoofknock.com', '2010-03-31 05:45:20', 'Come Laddy', '388')
---
  def create
    @lyric = Lyric.new(params[:lyric])

    respond_to do |format|
      if @lyric.save

SELECT * FROM "lyrics" WHERE ("lyrics"."id" = 2)
UPDATE "lyrics" SET "updated_at" = '2010-04-02 01:03:09', "image_url" = 'californication' WHERE "id" = 2
---
  def update
    @lyric = Lyric.find(params[:id])

    respond_to do |format|
      if @lyric.update_attributes(params[:lyric])

SELECT * FROM "lyrics" WHERE ("lyrics"."id" = 1)
DELETE FROM "lyrics" WHERE "id" = 1
---
  def destroy
    @lyric = Lyric.find(params[:id])
    @lyric.destroy